---
kind: type
id: T:Autodesk.Revit.DB.FlowDirectionType
source: html/f32da4fd-b137-448c-0636-693f983c2b48.htm
---
# Autodesk.Revit.DB.FlowDirectionType

An enumerated type listing direction types for a connector.

## Syntax (C#)
```csharp
public enum FlowDirectionType
```